app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "added using ajax"], ["created_at", "2014-08-15 05:13:32.021890"], ["post_id", 1], ["updated_at", "2014-08-15 05:13:32.021890"]]
---
  <p>
  	<strong>Posted <%= time_ago_in_words(comment.created_at) %> </strong> <br/>